Repository: Usuario128/Restaurante
Catalog: *.lproj/Localizable.strings
Languages: es

# error_email_invalido
source: Invalid email format.
es: Formato de correo electrónico no válido.

# error_telefono
source: Phone must be exactly 10 digits.
es: El teléfono debe tener exactamente 10 dígitos.

# error_contrasena_no_coincide
source: Passwords do not match.
es: Las contraseñas no coinciden.

# error_contrasena_segura
source: Password must be at least 8 characters with letters and numbers.
es: La contraseña debe tener al menos 8 caracteres con letras y números.

# error_terminos
source: You must accept the terms and conditions.
es: Debe aceptar los términos y condiciones.

# error_email_existente
source: The email is already registered.
es: El correo electrónico ya está registrado.

# reservar_mesa_titulo
source: Reserve Table
es: Reservar mesa

# campo_nombre_cliente
source: Customer Name
es: Nombre del cliente

# campo_numero_personas
source: Number of People
es: Número de personas

# campo_horario
source: Time
es: Horario

# boton_guardar
source: Save
es: Guardar

# usuarios_registrados
source: Registered Users
es: Usuarios Registrados

# buscar_por_nombre
source: Search by name...
es: Buscar por nombre...

# no_resultados
source: No results found for "%@".
es: No se encontraron resultados para "%@".

# rol_administrador
source: Administrator
es: Administrador

# rol_gerente
source: Manager
es: Gerente

# rol_empleado
source: Employee
es: Empleado

# rol_cliente
source: Customer
es: Cliente

# ver_perfil
source: View Profile
es: Ver Perfil

# eliminar
source: Delete
es: Eliminar

# registrar_nuevo_usuario
source: Register New User
es: Registrar Nuevo Usuario

# alerta_eliminar_usuario
source: Do you want to delete this user?
es: ¿Deseas eliminar este usuario?

# cancelar
source: Cancel
es: Cancelar

# confirmar_eliminar
source: Delete
es: Eliminar

# registro_email_placeholder
source: Email
es: Correo electrónico
