Repository: Usuario128/Restaurante
Catalog: *.lproj/Localizable.strings
Languages: es

# subtitulo_descripcion
source: The site that allows you to register and manage your reservations easily
es: El sitio que te permitirá registrarte y gestionar tus reservas de manera fácil

# mensaje_no_imagenes
source: No images were found in the assets.
es: No se encontraron imágenes en los assets.

# boton_politica
source: Privacy Policy
es: Política de Privacidad

# boton_terminos
source: Terms of Use
es: Términos de Uso

# boton_sobre_nosotros
source: About Us
es: Sobre Nosotros

# boton_iniciar_sesion
source: Login
es: Iniciar Sesión

# boton_registrarse
source: Sign Up
es: Registrarse

# footer_derechos
source: © 2024 ReservaMesa. All rights reserved.
es: © 2024 ReservaMesa. Todos los derechos reservados.

# login_titulo
source: Login
es: Iniciar Sesión

# login_email_placeholder
source: Enter your email
es: Ingresa tu email

# login_password_placeholder
source: Enter your password
es: Ingresa tu contraseña

# login_recordarme
source: Remember me
es: Recordarme

# login_boton
source: Login
es: Iniciar Sesión

# login_error_campos
source: All fields are required.
es: Todos los campos son obligatorios.

# login_error_credenciales
source: Incorrect credentials.
es: Credenciales incorrectas.

# login_error_inactivo
source: Your account is inactive. Contact the administrator.
es: Tu cuenta está inactiva. Contacta al administrador.

# politica_titulo
source: Privacy Policy
es: Políticas de Privacidad

# politica_subtitulo
source: Get information about our privacy policies
es: Obtenga la información sobre nuestras políticas de privacidad

# politica_1_titulo
source: 1. Information We Collect
es: 1. Información que Recopilamos

# politica_1_contenido
source: We collect personal information when you register on our platform, make a reservation, or interact with our system. The information we collect may include: • Contact data: Name, email address, phone number. • Reservation information: Date, time, number of people, and details of the reserved table. • Comments and reviews: Information you choose to provide about your experience at the restaurant. • Payment information: If you make payments through our platform, we collect data related to the transaction through an external payment processor.
es: Recopilamos información personal cuando te registras en nuestra plataforma, realizas una reserva o interactúas con nuestro sistema. La información que recopilamos puede incluir: • Datos de contacto: Nombre, dirección de correo electrónico, número de teléfono. • Información de la reserva: Fecha, hora, número de personas y detalles de la mesa reservada. • Comentarios y valoraciones: Información que decides proporcionarnos sobre tu experiencia en el restaurante. • Información de pago: Si realizas pagos a través de nuestra plataforma, recopilamos la información relacionada con la transacción a través de un procesador de pagos externo.

# politica_2_titulo
source: 2. Use of Information
es: 2. Uso de la Información

# politica_2_contenido
source: The information collected is used to: • Manage your reservations: Confirm, modify, or cancel your bookings. • Provide a better experience: Improve the service offered, manage your comments and suggestions. • Communicate with you: Send reservation confirmations, updates, and promotions. • Comply with legal obligations: Manage records and transactions according to applicable laws.
es: La información recopilada se utiliza para: • Gestionar tus reservas: Confirmar, modificar o cancelar tus reservas. • Proporcionar una mejor experiencia: Mejorar el servicio ofrecido, gestionar tus comentarios y sugerencias. • Comunicarnos contigo: Enviar confirmaciones de reservas, actualizaciones y promociones. • Cumplir con las obligaciones legales: Gestionar registros y transacciones según las leyes aplicables.

# politica_3_titulo
source: 3. Information Protection
es: 3. Protección de la Información

# politica_3_contenido
source: We implement security measures to protect your personal information, but you should be aware that no Internet data transmission is 100% secure. We use encryption protocols to protect sensitive data during transmission.
es: Implementamos medidas de seguridad para proteger tu información personal, pero debes tener en cuenta que ninguna transmisión de datos por Internet es 100% segura. Utilizamos protocolos de cifrado para proteger los datos sensibles durante la transmisión.

# politica_4_titulo
source: 4. Sharing Information with Third Parties
es: 4. Compartir Información con Terceros

# politica_4_contenido
source: We do not sell, rent, or share your personal information with third parties, except in the following cases: • Service providers: We contract third parties to process payments and manage some system functions. • Legal compliance: We may disclose your information if required by law or a government authority.
es: No vendemos, alquilamos ni compartimos tu información personal con terceros, excepto en los siguientes casos: • Proveedores de servicios: Contratamos a terceros para procesar pagos y gestionar algunas funciones del sistema. • Cumplimiento legal: Podemos divulgar tu información si así lo requiere la ley o una autoridad gubernamental.

# politica_5_titulo
source: 5. Your Information Rights
es: 5. Derechos sobre tu Información

# politica_5_contenido
source: You have the right to: • Access, correct, or delete your personal information. • Opt out of receiving promotional or marketing communications. If you wish to exercise these rights, contact us at marcelo.neri@iest.edu.mx.
es: Tienes derecho a: • Acceder, corregir o eliminar tu información personal. • Optar por no recibir comunicaciones promocionales o de marketing. Si deseas ejercer estos derechos, contáctanos a través de marcelo.neri@iest.edu.mx.

# politica_6_titulo
source: 6. Cookies and Similar Technology
es: 6. Cookies y Tecnología Similar

# politica_6_contenido
source: We use cookies and similar technologies to improve your experience, personalize content, and analyze traffic. You can disable cookies in your browser, but some system features may be affected.
es: Utilizamos cookies y tecnologías similares para mejorar tu experiencia, personalizar el contenido y analizar el tráfico. Puedes desactivar las cookies en tu navegador, pero algunas funcionalidades del sistema pueden verse afectadas.

# politica_7_titulo
source: 7. Changes to this Policy
es: 7. Cambios en esta Política

# politica_7_contenido
source: We reserve the right to update or modify this privacy policy at any time. We will notify you of any important changes through a notice on the website.
es: Nos reservamos el derecho de actualizar o modificar esta política de privacidad en cualquier momento. Te notificaremos sobre cualquier cambio importante mediante un aviso en el sitio web.

# politica_footer
source: © 2024 ReservaMesa. All rights reserved.
es: © 2024 ReservaMesa. Todos los derechos reservados.

# registro_titulo
source: Register
es: Registro

# registro_nombre_placeholder
source: Name
es: Nombre

# registro_telefono_placeholder
source: Phone
es: Teléfono

# registro_direccion_placeholder
source: Address
es: Dirección

# registro_password_placeholder
source: Password
es: Contraseña

# registro_confirmar_password_placeholder
source: Confirm Password
es: Confirmar Contraseña

# registro_subir_imagen
source: Upload Image
es: Subir Imagen:

# registro_acepto_terminos
source: I accept the terms
es: Acepto los términos y condiciones

# registro_boton
source: Sign Up
es: Registrarme

# registro_error_campos
source: All fields are required
es: Todos los campos son obligatorios y debe aceptar los términos.

# registro_error_email
source: Invalid email format
es: Formato de email no válido.

# registro_error_telefono
source: Invalid phone number
es: El teléfono debe contener exactamente 10 dígitos.

# registro_error_password_formato
source: Password must be at least 8 characters with letters and numbers
es: La contraseña debe tener al menos 8 caracteres, incluir letras y números.

# registro_error_password_match
source: Passwords do not match
es: Las contraseñas no coinciden.

# sobre_titulo_principal
source: Welcome to the ReservaMesa Reservation Management System
es: Bienvenido al Sistema de Gestión de Reservas ReservaMesa

# sobre_subtitulo_principal
source: Reserve your table, check the menu, and much more.
es: Reserva tu mesa, consulta el menú y mucho más.

# sobre_seccion_acerca
source: About Our Service
es: Acerca de Nuestro Servicio

# sobre_contenido_acerca
source: The restaurant reservation management system is designed to provide an efficient and convenient experience for both users and restaurant staff. This system aims to simplify the table reservation process, menu consultation, and feedback management.
es: El sistema de gestión de reservas para el restaurante está diseñado para ofrecer una experiencia eficiente y conveniente tanto para los usuarios como para el personal del restaurante. A través de este sistema, se busca facilitar el proceso de reserva de mesas, consulta del menú y gestión de comentarios.

# sobre_seccion_como_funciona
source: How It Works
es: ¿Cómo Funciona?

# sobre_contenido_como_funciona
source: Using our system is very easy: • Online Reservation: Choose the date, time, and number of people to reserve your table. • Menu Consultation: Browse our complete menu to see daily specials and à la carte options. • Manage Your Reservations: You can view, modify, or cancel your reservations at any time. • Leave Feedback: At the end of your experience, you can leave a comment about the food and service.
es: Usar nuestro sistema es muy sencillo: • Reserva en línea: Escoge la fecha, hora y número de personas para reservar tu mesa. • Consulta el Menú: Navega por nuestro menú completo para ver nuestras especialidades del día y opciones a la carta. • Gestiona tus reservas: Puedes ver, modificar o cancelar tus reservas en cualquier momento. • Deja comentarios: Al finalizar tu experiencia, puedes dejar un comentario sobre la comida y el servicio.

# sobre_seccion_servicios
source: Available Services
es: Servicios Disponibles

# sobre_contenido_servicios
source: • Online Reservations: Book your table from anywhere, anytime. • Interactive Menu: Check our digital menu, with images and detailed descriptions. • Reservation Management: Access your reservation history and make changes or cancellations easily. • Feedback and Ratings: Leave your comments about the service and dining options.
es: • Reservas en línea: Reserva tu mesa desde cualquier lugar, en cualquier momento. • Menú Interactivo: Consulta nuestro menú digital, con imágenes y descripciones detalladas. • Gestión de Reservas: Accede a tu historial de reservas y realiza cambios o cancelaciones fácilmente. • Comentarios y Valoraciones: Deja tus comentarios sobre el servicio y las opciones gastronómicas.

# sobre_seccion_contacto
source: Contact
es: Contacto

# sobre_contenido_contacto
source: For any inquiries or if you need assistance, do not hesitate to contact us: • Email: marcelo.neri@iest.edu.mx • Phone: 845 103 3478 • Address: Calle Ejemplo 123, City, Country
es: Para cualquier consulta o si necesitas asistencia, no dudes en contactarnos: • Correo Electrónico: marcelo.neri@iest.edu.mx • Teléfono: 845 103 3478 • Dirección: Calle Ejemplo 123, Ciudad, País

# sobre_footer
source: © 2024 ReservaMesa. All rights reserved.
es: © 2024 ReservaMesa. Todos los derechos reservados.

# terminos_titulo_principal
source: Terms of Use
es: Términos de Uso

# terminos_subtitulo_principal
source: Get information about the service usage conditions
es: Obtenga la información sobre las condiciones por el uso del servicio

# terminos_seccion_acceso
source: 1. System Access
es: 1. Acceso al Sistema

# terminos_contenido_acceso
source: Access to the reservation system is allowed only for people over 18 years old. By using our system, you confirm that you are of legal age.
es: El acceso al sistema de reservas está permitido exclusivamente para personas mayores de 18 años. Al utilizar nuestro sistema, confirmas que tienes la edad legal para hacerlo.

# terminos_seccion_responsabilidad
source: 2. User Responsibility
es: 2. Responsabilidad del Usuario

# terminos_contenido_responsabilidad
source: By using our reservation system, you agree to: • Provide truthful and accurate information in your registration and reservations. • Keep your account and password confidential. • Not use the system for illegal or fraudulent purposes. • Not make multiple reservations for the same event without intending to attend.
es: Al utilizar nuestro sistema de reservas, te comprometes a: • Proporcionar información veraz y precisa en tu registro y reservas. • Mantener la confidencialidad de tu cuenta de usuario y contraseña. • No utilizar el sistema para fines ilegales o fraudulentos. • No realizar reservas múltiples para el mismo evento sin la intención de asistir.

# terminos_seccion_uso
source: 3. Use of the Reservation System
es: 3. Uso del Sistema de Reservas

# terminos_contenido_uso
source: The reservation system is intended only for booking tables at [Restaurant Name]. Using the platform for fraudulent, invasive, or unauthorized bookings is prohibited.
es: El sistema de reservas está destinado únicamente para realizar reservas de mesas en [Nombre del Restaurante]. No está permitido utilizar la plataforma para realizar reservas fraudulentas, invasivas o no autorizadas.

# terminos_seccion_cancelacion
source: 4. Cancellation and Reservation Modification Policy
es: 4. Política de Cancelación y Modificación de Reservas

# terminos_contenido_cancelacion
source: You can modify or cancel your reservations through the system at any time, within established limits. Cancellations within a minimum period may be subject to charges according to restaurant policies.
es: Puedes modificar o cancelar tus reservas a través del sistema en cualquier momento, dentro de los límites establecidos. Las reservas canceladas dentro de un plazo mínimo pueden estar sujetas a cargos, según las políticas del restaurante.

# terminos_seccion_comentarios
source: 5. Comments and Reviews
es: 5. Comentarios y Valoraciones

# terminos_contenido_comentarios
source: Users can leave comments and reviews about their experience at the restaurant. You agree that such comments may be published on our website and used to improve our services.
es: Los usuarios pueden dejar comentarios y valoraciones sobre su experiencia en el restaurante. Aceptas que dichos comentarios pueden ser publicados en nuestro sitio web y ser utilizados para mejorar nuestros servicios.

# terminos_seccion_propiedad
source: 6. Intellectual Property
es: 6. Propiedad Intelectual

# terminos_contenido_propiedad
source: All intellectual property rights of the website content belong to [Restaurant Name] or its licensors. Reproduction, distribution, or modification without prior consent is prohibited.
es: Todos los derechos de propiedad intelectual sobre el contenido del sitio web son propiedad de [Nombre del Restaurante] o de sus licenciantes. Queda prohibida la reproducción, distribución o modificación de dicho contenido sin consentimiento previo.

# terminos_seccion_exoneracion
source: 7. Disclaimer
es: 7. Exoneración de Responsabilidad

# terminos_contenido_exoneracion
source: The restaurant is not responsible for: • Any errors or inaccuracies in the information provided by users. • Any damage or loss arising from the use of the reservation system or website access.
es: El restaurante no se hace responsable de: • Cualquier error o inexactitud en la información proporcionada por los usuarios. • Cualquier daño o pérdida derivada del uso del sistema de reservas o del acceso al sitio web.

# terminos_seccion_modificacion
source: 8. Modification of Terms
es: 8. Modificación de los Términos

# terminos_contenido_modificacion
source: We reserve the right to modify these Terms of Use at any time. Any changes will be published on this page with the update date.
es: Nos reservamos el derecho de modificar estos Términos de Uso en cualquier momento. Cualquier cambio será publicado en esta página con la fecha de actualización.

# terminos_seccion_ley
source: 9. Governing Law
es: 9. Ley Aplicable

# terminos_contenido_ley
source: These Terms of Use shall be governed and interpreted in accordance with the laws of the country where the restaurant operates.
es: Estos Términos de Uso se regirán e interpretarán de acuerdo con las leyes del país en el que opera el restaurante.

# terminos_footer
source: © 2024 ReservaMesa. All rights reserved.
es: © 2024 ReservaMesa. Todos los derechos reservados.

# boton_regresar
source: Back
es: Regresar

# admin_panel_titulo
source: Control Panel
es: Panel de Control

# admin_panel_subtitulo
source: Select an option to manage the system
es: Selecciona una opción para gestionar el sistema

# admin_nombre
source: 👤 Name:
es: 👤 Nombre:

# admin_telefono
source: 📞 Phone:
es: 📞 Teléfono:

# admin_direccion
source: 🏠 Address:
es: 🏠 Dirección:

# admin_rol
source: 🧩 Role:
es: 🧩 Rol:

# admin_estado
source: ⚙️ Status:
es: ⚙️ Estado:

# activo
source: Active
es: Activo

# inactivo
source: Inactive
es: Inactivo

# admin_ver_reservas
source: 📋 View Reservations and Tables
es: 📋 Visualizar Reservas y Mesas

# admin_ver_usuarios
source: 👥 View Users
es: 👥 Visualizar Usuarios

# admin_ver_menu
source: 🍽️ View Menus
es: 🍽️ Visualizar Menús

# admin_generar_qr
source: 🔳 Generate Employee QR
es: 🔳 Generar QR del Empleado

# admin_cerrar_sesion
source: 🚪 Log Out
es: 🚪 Cerrar Sesión

# mesa_datos_seccion
source: Table Details
es: Datos de la mesa

# mesa_numero_placeholder
source: Table Number
es: Número de mesa

# mesa_capacidad_placeholder
source: Capacity (people)
es: Capacidad (personas)

# mesa_titulo
source: New Table
es: Nueva Mesa

# mesa_boton_guardar
source: Save
es: Guardar

# mesa_boton_cancelar
source: Cancel
es: Cancelar

# mesa_error_numero
source: Invalid table number.
es: Número de mesa inválido.

# mesa_error_capacidad
source: Invalid capacity.
es: Capacidad inválida.

# mesa_error_existente
source: A table with this number already exists.
es: Ya existe una mesa con ese número.

# agregar_platillo_titulo
source: Add Dish
es: Agregar Platillo

# platillo_informacion_seccion
source: Dish Information
es: Información del platillo

# platillo_nombre_placeholder
source: Name
es: Nombre

# platillo_descripcion_placeholder
source: Description
es: Descripción

# platillo_precio_placeholder
source: Price
es: Precio

# platillo_categoria_picker
source: Category
es: Categoría

# platillo_imagen_seccion
source: Image
es: Imagen

# platillo_imagen_boton
source: Select Image
es: Seleccionar imagen

# platillo_boton_guardar
source: Save
es: Guardar

# platillo_boton_cancelar
source: Cancel
es: Cancelar

# cuenta_titulo
source: Table %d Bill
es: Cuenta Mesa %d

# cuenta_no_pedidos
source: No orders recorded.
es: No hay pedidos registrados.

# cuenta_boton_cerrar
source: Close Bill
es: Cerrar cuenta

# detalle_mesa_titulo
source: Table %d
es: Mesa %d

# detalle_mesa_reservada_por
source: Reserved by: %@
es: Reservada por: %@

# detalle_mesa_personas
source: People: %d
es: Personas: %d

# detalle_mesa_horario
source: Time: %@
es: Horario: %@

# detalle_mesa_sin_reservacion
source: No reservation
es: Sin reservación

# detalle_mesa_cuenta_total
source: Total bill: $%.2f
es: Cuenta total: $%.2f

# detalle_mesa_boton_reservar
source: Reserve Table
es: Reservar mesa

# detalle_mesa_boton_ver_pedido
source: View / Edit Order
es: Ver / Editar Pedido

# editar_platillo_titulo
source: Edit Dish
es: Editar Platillo

# editar_platillo_seccion_informacion
source: Information
es: Información

# editar_platillo_nombre
source: Name
es: Nombre

# editar_platillo_descripcion
source: Description
es: Descripción

# editar_platillo_precio
source: Price
es: Precio

# editar_platillo_categoria
source: Category
es: Categoría

# editar_platillo_seccion_imagen
source: Image
es: Imagen

# editar_platillo_cambiar_imagen
source: Change Image
es: Cambiar imagen

# lista_mesas_titulo
source: Available Tables
es: Mesas disponibles

# mesa_disponible
source: Available
es: Disponible

# mesa_ocupada
source: Occupied
es: Ocupada

# mesa_capacidad
source: Capacity: %d
es: Capacidad: %d

# boton_agregar_mesa
source: Add Table
es: Agregar Mesa

# menu_pedido_titulo
source: Order Management
es: Gestión de Pedido

# boton_cerrar_cuenta
source: Close Account
es: Cerrar cuenta

# boton_volver
source: Back
es: Volver

# alerta_cerrar_cuenta_titulo
source: Close account?
es: ¿Cerrar cuenta?

# alerta_cerrar_cuenta_mensaje
source: All orders will be deleted and the table will be available.
es: Se eliminarán todos los pedidos y la mesa quedará disponible.

# alerta_cerrar_cuenta_cancelar
source: Cancel
es: Cancelar

# alerta_cerrar_cuenta_confirmar
source: Confirm
es: Confirmar

# menu_titulo
source: Restaurant Menu
es: Menú del Restaurante

# boton_agregar
source: Add
es: Agregar

# categoria_entrada
source: Appetizers
es: Entradas

# categoria_fuerte
source: Main Courses
es: Platos Fuertes

# categoria_postre
source: Desserts
es: Postres

# categoria_bebida
source: Drinks
es: Bebidas

# menu_vacio
source: There are currently no dishes in the menu.
es: No hay platillos en el menú actualmente.

# perfil_titulo
source: User General Information
es: Datos Generales del Usuario

# perfil_subtitulo
source: Here you can view the user's information
es: Aquí se puede visualizar la información del usuario

# label_nombre
source: Name
es: Nombre

# label_telefono
source: Phone
es: Teléfono

# label_direccion
source: Address
es: Dirección

# label_rol
source: Role
es: Rol

# label_estado
source: Status
es: Estado

# label_fecha_registro
source: Registration Date
es: Fecha de Registro

# label_hora_registro
source: Registration Time
es: Hora de Registro

# estado_activo
source: Active
es: Activo

# estado_inactivo
source: Inactive
es: Inactivo

# horarios_titulo
source: Work Schedules
es: Horarios de trabajo

# label_tipo_turno
source: Shift Type
es: Tipo de Turno

# label_hora_inicio
source: Start Time
es: Hora Inicio

# label_hora_fin
source: End Time
es: Hora Fin

# turno_completo
source: Full
es: Completo

# turno_vespertino
source: Evening
es: Vespertino

# turno_matutino
source: Morning
es: Matutino

# turno_nocturno
source: Night
es: Nocturno

# sin_imagen
source: No Image
es: Sin Imagen

# qr_titulo
source: Employee QR
es: QR del Empleado

# qr_generando
source: Generating QR...
es: Generando QR...

# si
source: Yes
es: Sí

# registro_subtitulo
source: Fill out the form to register a new employee
es: Complete el formulario para registrar un nuevo empleado

# campo_nombre
source: Full Name
es: Nombre Completo

# campo_telefono
source: Phone
es: Teléfono

# campo_direccion
source: Address
es: Dirección

# campo_puesto
source: Role
es: Puesto

# puesto_administrador
source: Administrator
es: Administrador

# puesto_gerente
source: Manager
es: Gerente

# puesto_empleado
source: Employee
es: Empleado

# puesto_cliente
source: Customer
es: Cliente

# campo_contrasena
source: Password
es: Contraseña

# campo_confirmar_contrasena
source: Confirm Password
es: Confirmar Contraseña

# imagen_opcional
source: Employee Image (optional):
es: Imagen del Empleado (opcional):

# seleccionar_imagen
source: Select Image
es: Seleccionar Imagen

# acepto_terminos
source: I accept the terms and conditions
es: Acepto los términos y condiciones

# boton_cancelar
source: Cancel
es: Cancelar

# boton_registrar
source: Register
es: Registrar

# alerta_exito_titulo
source: Successful Registration
es: Registro Exitoso

# alerta_exito_mensaje
source: The employee has been successfully registered.
es: El empleado fue registrado correctamente.

# alerta_aceptar
source: OK
es: Aceptar

# error_campos_vacios
source: All fields are required.
es: Todos los campos son obligatorios.
